{
    "Home": {
      "greeting": "Bonjour,",

      "hey": "salut",
      "nicetomeetyou": "ravi de vous rencontrer",
      "welcome": "bienvenue",
      "givemeajob": "embauchez-moi",
      "clickaround": "faites un tour",

      "l1": "Je m'appelle ",
      "l2": ". Je suis actuellement étudiant à ",
      "l3": " à Nantes, en France, en vue de devenir ",
      "dev1": "développeur ",
      "dev2": "front-end",
      "l4": "Depuis que j'ai commencé à coder en octobre 2023, j'ai travaillé sur ",
      "projects": "plusieurs projets",
      "l5": ", dont un ",
      "ecommerce": "site de commerce en ligne",
      "l6": " et ",
      "thisPortfolio": "ce portfolio",
      "l7": "J'aime aussi tout ce qui est design, vous pouvez voir plus de mon travail sur ",
      "l8": " et ",
      "l9": " Vous pouvez également me contacter par ",
      "l10": "email ou par d'autres moyens",
      "dot": "."
    },
    "HireWindow": {
      "to": "pour:",
      "futureEmployer": "futur employeur",
      "hello": "Bonjour futur employeur,",
      "line1": "Je suis à la recherche d'une alternance de développement front-end en France, débutant en juin 2024.",
      "line2": "Le planning serait 4 jours en entreprise / 1 jour d’école.",
      "line3part1": "Vous pouvez voir mes projets ",
      "line3part2": ", et me contacter ",
      "line3part3": ".",
      "here": "ici",
      "line4": "Hâte de rejoindre votre équipe !",
      "name": "Mathurin Sekine",
      "deleteButtonLabel": "non"
    },
    "NavBar": {
      "language": "in english",
      "home": "accueil",
      "projects": "mes projets",
      "notes": "mes notes",
      "contact": "contact",
      "mainproject": "Projet plateforme de vente",
      "pico-8": "Jeu PICO-8",
      "more-projects": "Plus de projets",
      "notes-comingsoon": "Bientôt disponible™",
      "article1": "Mon premier portfolio",
      "article2": "Apprendre à coder",
      "article3": "Mon prochain projet"
    },
    "Projects" : {
      "portfolio": "Portfolio",
      "ecommerce": "Plateforme de vente",
      "dataviz": "Site web dataviz",
      "chromeextension": "Extension Chrome",
      "pico8game": "Jeu Pico-8",
      "presenterapp": "Appli de Présentation sans Titre",
      "phpsocialnetwork": "Réseau Social PHP",
      "schoolproject": "projet d'école",
      "personalproject": "projet personnel"
    },
    "Contact": {
      "email": "je répondrai dès que possible",
      "linkedin": "bientôt disponible",
      "github": "mes projets de dév",
      "twitter": "actuellement pas très actif",
      "dribbble": "projets de design",
      "layers": "plus de projets de design",
      "readcv": "mon cv",
      "clipboard": "enregistré dans le presse-papiers"
    },
    "CaseStudy": {
      "schoolproject": "Projet d'école",
      "personalproject": "Projet personnel",
      "githubrepository": "Voir le repo sur Github",
      "projectoverview": "Présentation du projet",
      "techstack": "Tech stack et outils",
      "teammates": "Coéquipiers",
      "screenshots": "Captures d'écran",
      "iterations": "Itérations",
      "whatilearned": "Ce que j'ai appris"
    },
    "CaseStudyEcommerce": {
      "title": "Projet plateforme de vente",
      "description": "L'objectif de ce projet était d'organiser 2 équipes de 5 personnes sur le front-end et le back-end, puis d'échanger les rôles au bout d'une semaine. J'ai commencé dans l'équipe front-end et j'ai posé les bases du design avec mes maquettes dans Figma, ainsi qu'en choisissant d'utiliser Shadcn/ui. La deuxième semaine, j'ai travaillé en partenariat avec des membres de l'équipe back-end pour créer des routes pour la page d'administration.",
      "whatilearnedtext": "J'ai appris à mieux coordonner une équipe et à utiliser une bibliothèque de composants. La découverte du monde du back-end avec Supabase et Express a également été intéressante."
    },
    "CaseStudyPico8": {
      "title": "Projet de jeu pico-8",
      "description": "C'était mon premier projet de groupe depuis le début de ma formation de développeur. On a découvert Lua et le moteur de jeu Pico-8. On pouvait créer n'importe quel type de jeu. Comme il s'agissait de notre premier projet, on a travaillé ensemble dans une configuration de mob programming. J'ai beaucoup travaillé sur la direction créative du jeu, ce qui impliquait la création du sprite du personnage ainsi que l'arrière-plan, le terrain et les éléments de l'interface utilisateur.",
      "whatilearnedtext": "J'ai appris à programmer en Lua et à comprendre les mécanismes fondamentaux des jeux tels que la gravité, les collisions et les game states. J'ai pris beaucoup de plaisir à travailler sur l'art, même si la palette de couleurs du Pico-8 est très limitée."
    },
    "CaseStudyDataviz": {
      "title": "Projet dataviz & API",
      "description": "L'objectif de ce projet était de récupérer des données à partir d'une API et d'afficher dynamiquement les résultats sur une page web. On a décidé d'utiliser l'API de la SNCF pour afficher le nombre d'objets perdus et trouvés sur leur réseau. Cette API est mise à jour trois fois par jour, ce qui a très bien fonctionné pour notre projet. J'ai principalement travaillé sur le front-end du site web, en recréant identité visuelle de la SNCF, allant jusqu'à rechercher et trouver la police de caractères qu'ils utilisent sur les panneaux dans les gares.",
      "whatilearnedtext": "J'ai appris à utiliser la mise en page automatique dans Figma, ainsi que le mode développeur pour passer rapidement de la maquette au code. Cela a considérablement accéléré mon travail. J'ai également appris comment fonctionnent les APIs."
    },
    "CaseStudyExtension": {
      "title": "Projet extension navigateur",
      "description": "On nous a demandé de créer une extension pour Google Chrome. Notre équipe a décidé de créer un minuteur Pomodoro. Je me suis inspiré du design de Teenage Engineering pour l'apparence de l'extension.",
      "whatilearnedtext": "J'ai découvert l'écosystème du navigateur et j'ai appris que je ne l'aimais pas."
    },
    "CaseStudyPHP": {
      "title": "Projet réseau social PHP",
      "description": "Ce projet était un peu différent, car on partait d'un code cassé qu'on était censé corriger et améliorer. Les fonctionnalités du site web ressemblaient beaucoup à celles de Twitter et de Facebook. Les utilisateurs devaient pouvoir créer des comptes, publier des messages, aimer des messages et suivre d'autres utilisateurs.",
      "whatilearnedtext": "J'ai appris à écrire du SQL, mais je n'ai pas beaucoup apprécié PHP.",
      "beforedesign": "Avant la refonte",
      "afterdesign": "Après la refonte"
    }
  }